{
    "index": {
        "title": "Index",
        "quote": "I would love the challenge to demonstrate how my skills, passion, imagination, and invention can benefit your company",
        "introduction": [
            {
                "title": "Education",
                "id": "education",
                "icon": "fa fa-graduation-cap fa-5x",
                "text": [
                    {
                        "key": "Rochester Institute of Technology",
                        "description": "BS Information Science Technology"
                    }
                ]
            },
            {
                "title": "Jobs Seeking",
                "id": "jobs-seeking",
                "icon": "fa fa-briefcase fa-5x",
                "text": [
                    {
                        "key": "Front-End Developer",
                        "description": ""
                    },
                    {
                        "key": "Software Engineer",
                        "description": ""
                    },
                    {
                        "key": "UI Designer",
                        "description": ""
                    },
                    {
                        "key": "Android Programmer",
                        "description": ""
                    }
                ]
            },
            {
                "title": "Favorite Quote",
                "id": "favorite-quote",
                "icon": "fa fa-heart fa-5x",
                "text": [
                    {
                        "key": "I am the master of my fate, I am the captain of my soul",
                        "description": "William Ernest Henley"
                    }
                ]
            }
        ],
        "skills": {
            "title": "Skills",
            "id": "skills",
            "icon": "fa fa-trophy fa-5x",
            "text": [
                {
                    "key": "Front-End Development",
                    "description": ["jQuery", "Ajax", "PHP", "JavaScript", "SEO"]
                },
                {
                    "key": "Programming",
                    "description": ["OOP", "Java", "C++", "Python", "Android"]
                },
                {
                    "key": "Templating Engines",
                    "description": ["SASS", "twig.js", "JsRender", "BackBone"]
                },
                {
                    "key": "Databases",
                    "description": ["SQL", "MongoDB", "Cassandra", "Security"]
                },
                {
                    "key": "Package Managers",
                    "description": ["Composer", "Bower"]
                },
                {
                    "key": "Version Controllers",
                    "description": ["Git", "BitBucket"]
                }
            ]    
        }
    },
    
    "projects": {
        "title": "Projects",
        
        "projectList" : [
            {
                "title": "LifeLine",
                "type": "Android App",
                "icon": "fa fa-life-ring",
                "description": "Harnessing the potential of technology, this Android app will empower students by giving them an emergency blue light in their back pocket.  LifeLine’s mission is to significantly decrease underreporting of sexual assault and abuse on college campuses. With the user’s safety a priority, the design is discrete and customizable.  LifeLine allows students immediate contact with campus police, preset emergency contacts, counseling, video and audio recordings securely stored on the cloud, and their own personal Ally.",
                "website": "",
                "git": "https://github.com/kelleyDanger/LifeLine",
                "android": "projects/LineLine.apk"
            },
            {
                "title": "Booze Buddy",
                "type": "Cordova Android App",
                "icon": "fa fa-beer",
                "description": "Booze Buddy is built as a Cordova project.  Market research was conducted on existing Android apps to develop a solution for those looking for affordable, local food and drink in their area, sorted by type or price. Responsiblilty is incorporated with a feature to call a taxi or find safe public transportation home.  UI sketches and prototypes were constructed into a user-friendly and social design utilizing composition patterns.",
                "website": "",
                "git": "https://github.com/kelleyDanger/BoozeBuddy",
                "android": ""
            },
            {
                "title": "Impossible Pokemon Memory Challenge",
                "type": "Android App",
                "icon": "icon-pokeball",
                "description": "Match the cards to capture the Pokemon!  Just be careful though, every wrong answer is a point lost.  This entertaining memory challenge Android game features animations and image resources that add to the excitement.  Colors, strings, and animations have all been defined in their appropriate xml files.  Just a warning, don't be too disappointed with a horrible score. You have been warned in the title: Impossible Challenge.",
                "website": "",
                "git": "https://github.com/kelleyDanger/Impossible-Pokemon-Memory-Challenge",
                "android": "/projects/ImpossiblePokemonMemoryChallenge.apk"
            },
            {
                "title": "Tim & Eric Show Promotional Website",
                "type": "Website",
                "icon": "fa fa-child",
                "description": "<i>Tim and Eric Awesome Show, Great Job! </i>, being a favorite sketch comedy television show of mine, was the focus of my promotional webpage.  Keeping in mind the audience was the integral focus of this project, therefore special attention was devoted to design, global and local navigation, external and imbedded stylesheets, and validated code."
            },
            {
                "title": "Human Slayer",
                "type": "SVG Web Game",
                "icon": "fa fa-rocket",
                "description": "The Rules are simple: guide your alien ship using the arrow keys, shoot, and fire at the humans.  Human Slayer applied the unique vector drawing capabilities of SVG into an interactive web game.   Instructions for play were provided to the user through the use of animations and JavaScript.  Primitive SVG shapes were used in combination with curves.<p><em>Note: to be viewed using either Opera or Safari browser due to viewing compatability.</em></p>",
                "website": "/projects/HumanSlayer/welcome.html",
                "git": "https://github.com/kelleyDanger/Human-Slayer",
                "android": ""
            },
            {
                "title": "RESTful Web Service",
                "type": "AJAX, jQuery",
                "icon": "fa fa-user-md",
                "description": "Using jQuery and AJAX to access and digest a RESTful service, this project showcased the ability to search data based on various inputs.  The supplied WADL was used to service the dynamic creation, animation, form validation, and browser detection and redirection.",
                "website": "http://people.rit.edu/~kas3101/240/ajax/index.html",
                "git": "https://github.com/kelleyDanger/RESTful-Web-Service",
                "android": ""
            },
            {
                "title": "Humans Vs Zombies Application Product Design",
                "type": "Application Design",
                "icon": "fa fa-male",
                "description": "Full design of an application to use while playing the beloved live action game of Humans Versus Zombies is the premise of this fun project.  The multipurpose and multifunction application consists of easy to access shortcuts to assist the Humans survivors. Players can keep track of their achievements, map out safezones, GPS locate where zombie hordes are, get tips and tutorials to help survive, but most importantly be able to kick as much zombie butt as possible!  User stories were curated, paper prototypes were developed and tested, only to be made into a website prototype based upon user feedback."
            },
            {
                "title": "One Love Boards",
                "type": "Website",
                "icon": "fa fa-heart",
                "description": "One of my first adventures into web design, my passion for longboards inspired this multi-paged website.  Prior to the design phase, competitive sites were researched, a list of pro and con features was generated, and much attention was paid to the audience’s needs and wants.  Meaningful and substantial content was produced, user-friendly navigation was put into place, images were manipulated using the GIMP software, and care was placed into cleaning, validating, and commenting all code.",
                "website": "/projects/OneLoveBoards/index.html",
                "git": "https://github.com/kelleyDanger/One-Love-Boards",
                "android": ""
            }
        ]
    },
    
    "resume": {
        "title": "Resume",
        "introduction": "<p>I graduated from Rochester Institute of Technology this May with a BS in Information Science Technology.  From my entrepreneurial successes and failures, as well as the many years I’ve worked in an office environment, I have learned the necessity of both individual and collaborate work.  In my time working for various companies, I have implemented an entirely new website with the collaboration of fellow employees and outside contractors, refined my programming skills, and further expanded upon my knowledge by taking advantage of learning opportunities outside of work.  My commitment and motivation to social activism, course work, and the refinement and growth of my craft demonstrates my strong will to develop innovative and creative solutions.</p><p>My passions range from front-end development (jQuery, Ajax), to Android application development and NoSQL databases (MongoDB, Cassandra).  I always focus on writing maintainable, object-oriented code.  I have progressed from writing simple HTML and CSS driven pages on Neopets to developing MVC patterned applications, setting up secure databases, and streamlining the development process through templating engines (twig.js, JsRender), package managers (Bower), and version controllers (Git, BitBucket).</p>",
        "download": {
            "link": "assets/resume_kelley_scanlon.pdf",
            "icon": "fa fa-download fa-4x"
        }
    },
    
     "contact": {
         "title": "Contact",
         "picture": "assets/img/portfolio_contact_large.jpg",
         "introduction": "<p>Leave a comment or reach out for potential job offers.</p>",
         "contacts": [
             {
                "title": "Phone: ",
                "icon": "fa fa-phone fa-5x",
                "text": "585.434.6263"
             },
             {
                "title": "Email: ",
                "icon": "fa fa-envelope fa-5x",
                "text": "kelleyscanlon@gmail.com"
             }
         ],
         "social": [
             { 
                "title": "GitHub",
                 "icon": "fa fa-github",
                 "link": "https://github.com/kelleyDanger"
             },
             { 
                "title": "LinkedIn",
                 "icon": "fa fa-linkedin",
                 "link": "https://www.linkedin.com/in/kelleyscanlon"
             },
             { 
                "title": "8tracks",
                 "icon": "icon-8tracks",
                 "link": "http://8tracks.com/kscandalous"
             },
             { 
                "title": "Pinterest",
                 "icon": "fa fa-pinterest",
                 "link": "https://www.pinterest.com/kscandalous/"
             }
         ]
    }
}